Revit 2027 API
AssemblyCodeTable.GetAssemblyCodeTable Method
 Returns the AssemblyCodeTable for the specified document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static AssemblyCodeTable GetAssemblyCodeTable(
	Document doc
)
Public Shared Function GetAssemblyCodeTable (
	doc As Document
) As AssemblyCodeTable
public:
static AssemblyCodeTable^ GetAssemblyCodeTable(
	Document^ doc
)
static member GetAssemblyCodeTable :
        doc : Document -> AssemblyCodeTable
Parameters
doc Document
 The document owns the AssemblyCodeTable.
Return Value
AssemblyCodeTable
 The AssemblyCodeTable for the document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AssemblyCodeTable Class
Autodesk.Revit.DB Namespace